
for x in range(1, 4):

    for y in range(1, 5):

        for z in range(1, 3):

            print(f"{x}, {y}, {z}")

# loop1(X) = 3 times -- loop2(y) = 12 times -- loop3(z) = 24 times

# ابتدا حلقه اول یکبار اجرا بعد حلقه دوم بعد حلقه سوم اجرا میشود.
# سپس حلقه سوم دوباره اجرا میشود تا اینکه تمام میشود وباز میگردد به حلقه دوم.
# حلقه دوم دوباره، یکبار  اجرا میشود بعد دوباره حلقه سوم دوبار اجرا میشود
# و این روند دوبار دیگر اجرا میشود تا بالاخره حلقه دوم هم تمام شده
# و مجدد حلقه اول اجرا میشود.
# به عبارتی، حلقه سوم دوبار که اجرا شد، یکبار حلقه دوم شماره جدید
# می اندازد. به همین طریق هم، حلقه دوم، چهار بار که اجرا شد،
# حلقه اول یک شماره جدید می اندازد
# حلقه اول 1 بار، حلقه دوم 12 بار و حلقه سوم 24 بار خوانده میشود
